app/controllers/account_informations_controller.rb

  def create
    @info=AccountInformation.new(params[:account_information])
    @info.user_id=@user.id
    if @info.save
---
INSERT INTO `account_informations` (`created_at`, `domeniucurent`, `specializare`, `updated_at`, `prenume`, `user_id`, `adresa`, `nume`, `promotia`, `email`) VALUES('2010-11-17 09:41:05', 'Informatica (web development, sever technologies)', 'Matematica si Informatica', '2010-11-17 09:41:05', 'Bogdan', NULL, 'horea nor 112', 'Mihut', 2009, NULL)

  def update
    @info=@user.accountInformation
    if @info.update_attributes(params[:account_information])
---
UPDATE `account_informations` SET `updated_at` = '2010-11-18 10:23:04', `email` = 'mihutbogdan@gmail.com' WHERE `id` = 6
UPDATE `users` SET `updated_at` = '2010-11-17 10:16:30', `last_request_at` = '2010-11-17 10:16:30' WHERE `id` = 5

    def load_user
    redirect_to "/" unless current_user
    @user = User.find(params[:user_id]) if current_user.role == "admin"
---
SELECT * FROM `users` WHERE (`users`.`id` = '7') LIMIT 1