app/controllers/account_information_controller.rb

    def load_user
    redirect_to "/" unless current_user
    params[:id]=params[:user_id] if params[:id].nil?
    @user = User.find(params[:id]) if current_user.role == "admin"
---
SELECT * FROM `users` WHERE (`users`.`id` = '5') LIMIT 1