app/controllers/messages_controller.rb

  def index
    @total = @user.messages.count
    @messages = @user.messages.paginate :page => params[:page], :per_page => 10
---
SELECT count(*) AS count_all FROM `messages` WHERE (`messages`.read = 1) AND (`messages`.user_id = 5)
SELECT * FROM `messages` WHERE (`messages`.user_id = 5) LIMIT 0, 10

  def create
    @message = Message.new(params[:message])
    if @message.save
---
INSERT INTO `messages` (`created_at`, `updated_at`, `subject`, `user_id`, `sent_from`, `r`, `sender_id`, `message`) VALUES('2010-11-18 11:15:19', '2010-11-18 11:15:19', 'salut', NULL, NULL, 0, 1, 'salut!\r\nnu team mai vazut de mult\r\nce faci? esti bine?')

  def show
    @message = Message.find(params[:id])
    @message.update_attribute(:r,1)
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 2)
UPDATE `messages` SET `updated_at` = '2010-11-17 11:27:25', `r` = 1 WHERE `id` = 4

  def destroy
    Message.find(params[:id]).destroy
---
DELETE FROM `messages` WHERE `id` = 1
SELECT * FROM `messages` WHERE (`messages`.`id` = 1)

  def load_user
    redirect_to "/" unless current_user

    @user = User.find(params[:user_id]) if current_user.role == "admin"
---
SELECT * FROM `users` WHERE (`users`.`id` = '5') LIMIT 1