app/controllers/promotia_controller.rb

SELECT * FROM `account_informations` WHERE (`account_informations`.user_id = 7) LIMIT 1
---
  def show
    @info=AccountInformation.all(:conditions => ['promotia = ?',params[:id]]).paginate :page=> params[:page], :per_page=> 10

SELECT * FROM `users` WHERE (`users`.`id` = '7') LIMIT 1
---
    def load_user
    redirect_to "/" unless current_user
    @user = User.find(params[:id]) if current_user.role == "admin"