app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    @users = User.all.paginate :page=>params[:page], :per_page=>10

SELECT * FROM `account_informations` WHERE (`account_informations`.user_id = 7) LIMIT 1
---
  def promotia
    @info=AccountInformation.all(:conditions => ['promotia = ?',@user.accountInformation.promotia]).paginate :page=> params[:page], :per_page=> 10

INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `updated_at`, `username`, `role`, `failed_login_count`, `password_salt`, `persistence_token`, `last_login_ip`, `last_login_at`) VALUES(NULL, '2010-10-16 15:38:57', '0852984df615f0885e366581178011407e10eb457650983edd070f5386ef965e88e0442fb826ee35a72bce50313ee854f0f021f4b88139e19b6ce986dc7882a0', '2010-10-16 15:38:57', 'yo_myh@yahoo.com', NULL, NULL, 'REQJ4zuEr5A5CUP-cRVg', '01efb6a8c0624c9c3eb95632cd925d27bb4149dc58a15d4cc1fd5c9d778a5672c17a1b3bd23bef9ede750a04221b9338416528229f8c35737e0c9e5775052757', NULL, NULL)
---
  def create
    @user = User.new(params[:user])
    if User.all.count == 0
      @user.role = "admin"
    else
      @user.role = "alumn"
    end
    if @user.save

UPDATE `users` SET `updated_at` = '2010-10-17 19:23:32', `crypted_password` = '88929757d487a9d1894d22dec0824d090c53cb5cf9df760e9b2de046da35c4aec04bd7136c2c6b24019353512b1beb9f13c6b8241ebbf32e73eacf12fd919bd7', `password_salt` = 'H3s6AZWXOG8JZE1kXYVZ', `persistence_token` = '605a6ad6d6c0d65ca29bbcb0b3800507595234bc264ff2f789562791dda67abb9cfb1c95a6d26242677d7927e4db5dd3ec1c8dc4a0e22d4050e8247337519f6d', `last_request_at` = '2010-10-17 19:23:32' WHERE `id` = 2
---
  def update
    respond_to do |format|
      if @user.update_attributes params[:user]

SELECT * FROM `users` WHERE (`users`.`id` = '7') LIMIT 1
---
    def load_user
    redirect_to "/" unless current_user
    @user = User.find(params[:id]) if current_user.role == "admin"